# GetSupportingElement Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSupport..::..GetSupportingElement Method
AnalyticalModelSupport Class See Also
---
Retrieves the actual Element Id providing support.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GetSupportingElement()
```

Visual Basic
---
```text
Public Function GetSupportingElement As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetSupportingElement()
```

# ### Return Value
Represents Element that provides support.
# See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace